from aiogram.types import Message
from aiogram import Bot


async def get_true_contact(message: Message, bot: Bot, phone: str):

    await message.answer(f"{message.from_user.first_name}, ты отправил мне свой контакт\n"
                         f"----------------------------\n"
                         f"Твой номер --> {phone}\n"
                         f"----------------------------\n"
                         f"Я его записал!🤝\n"
                         f"============================\n"
                         f"Передача контактов пользователей третьим лицам == 🐷\n"
                         f"============================\n"
                         f"Твой контакт мы никому не передадим!🥷🏻\n"
                         f"----------------------------\n"
                         f"🔥Хорошего дня!🔥\n")


async def get_fake_contact(message: Message, bot: Bot):
    await message.answer(f"{message.from_user.first_name}, похоже ты отправил нам не свой контакт.\n"
                         f"----------------------------\n"
                         f"Пожалуйста укажи номер привязанный к этому аккаунту\n"
                         f"----------------------------\n"
                         f"Не переживай,\n"
                         f"мы не делимся контактами и данными наших пользователей🥷🏻\n"
                         f"============================\n"
                         f"🔒Желаем того же другим!🐣\n"
                         f"============================\n")
